IntergatedCircuits/STM32_XPD/STM32F3_XPD/inc/xpd_adc.h
/** @defgroup ADC_Core_Exported_Functions ADC Core Exported Functions
 * @{ */
XPD_ReturnType  XPD_ADC_Init                (ADC_HandleType * hadc, const ADC_InitType * Config);
XPD_ReturnType  XPD_ADC_Deinit              (ADC_HandleType * hadc);
void            XPD_ADC_ChannelConfig       (ADC_HandleType * hadc, const ADC_ChannelInitType * Channels,
                                             uint8_t ChannelCount);

void            XPD_ADC_Start               (ADC_HandleType * hadc);
void            XPD_ADC_Stop                (ADC_HandleType * hadc);
XPD_ReturnType  XPD_ADC_PollStatus          (ADC_HandleType * hadc, ADC_OperationType Operation,
                                             uint32_t Timeout);

void            XPD_ADC_Start_IT            (ADC_HandleType * hadc);
void            XPD_ADC_Stop_IT             (ADC_HandleType * hadc);
void            XPD_ADC_IRQHandler          (ADC_HandleType * hadc);

XPD_ReturnType  XPD_ADC_Start_DMA           (ADC_HandleType * hadc, void * Address);
void            XPD_ADC_Stop_DMA            (ADC_HandleType * hadc);

void            XPD_ADC_WatchdogConfig      (ADC_HandleType * hadc, ADC_WatchdogType Watchdog,
                                             const ADC_WatchdogThresholdType * Config);
ADC_WatchdogType XPD_ADC_WatchdogStatus     (ADC_HandleType * hadc);

/**
 * @brief Return the result of the last ADC regular conversion.
 * @param hadc: pointer to the ADC handle structure
 * @return The conversion result
 */
__STATIC_INLINE uint16_t XPD_ADC_GetValue(ADC_HandleType * hadc)
{
    return (uint16_t)hadc->Inst->DR;
}

/** @} */

/** @} */

/** @defgroup ADC_Injected ADC Injected Conversions
 * @{ */

/** @defgroup ADC_Injected_Exported_Types ADC Injected Exported Types
 * @{ */

/** @brief ADC injected trigger sources */
typedef enum
{
    ADC_INJTRIGGER_SOFTWARE  = 16  /*!< Implicit trigger by software on start call */
}ADC_InjTriggerSourceType;

/** @brief ADC1 and 2 injected trigger sources */
typedef enum
{
    ADC1_2_INJTRIGGER_TIM1_TRGO  = 0,  /*!< TIM1 Trigger Out */
    ADC1_2_INJTRIGGER_TIM1_CC4   = 1,  /*!< TIM1 Channel 4 */
    ADC1_2_INJTRIGGER_TIM2_TRGO  = 2,  /*!< TIM2 Trigger Out */
    ADC1_2_INJTRIGGER_TIM2_CC1   = 3,  /*!< TIM2 Channel 1 */
    ADC1_2_INJTRIGGER_TIM3_CC4   = 4,  /*!< TIM3 Channel 4 */
    ADC1_2_INJTRIGGER_TIM4_TRGO  = 5,  /*!< TIM4 Trigger Out */
    ADC1_2_INJTRIGGER_EXTI15     = 6,  /*!< EXTI Line 15 */
    ADC1_2_INJTRIGGER_TIM8_CC4   = 7,  /*!< TIM8 Channel 4 */
    ADC1_2_INJTRIGGER_TIM1_TRGO2 = 8,  /*!< TIM1 Trigger Out 2 */
#ifdef HRTIM1
    ADC1_2_INJTRIGGER_HRTIM_TRG2 = 9,  /*!< HRTIM Trigger 2 */
    ADC1_2_INJTRIGGER_HRTIM_TRG4 = 10, /*!< HRTIM Trigger 4 */
#else
    ADC1_2_INJTRIGGER_TIM8_TRGO  = 9,  /*!< TIM8 Trigger Out */
    ADC1_2_INJTRIGGER_TIM8_TRGO2 = 10, /*!< TIM8 Trigger Out 2 */
#endif
    ADC1_2_INJTRIGGER_TIM3_CC3   = 11, /*!< TIM3 Channel 3 */
    ADC1_2_INJTRIGGER_TIM3_TRGO  = 12, /*!< TIM3 Trigger Out */
    ADC1_2_INJTRIGGER_TIM3_CC1   = 13, /*!< TIM3 Channel 1 */
    ADC1_2_INJTRIGGER_TIM6_TRGO  = 14, /*!< TIM6 Trigger Out */
    ADC1_2_INJTRIGGER_TIM15_TRGO = 15, /*!< TIM15 Trigger Out */
    ADC1_2_INJTRIGGER_SOFTWARE   = 16  /*!< Implicit trigger by software on start call */
}ADC1_2_InjTriggerSourceType;

/** @brief ADC3 and 4 injected trigger sources */
typedef enum
{
    ADC3_4_INJTRIGGER_TIM1_TRGO  = 0,  /*!< TIM1 Trigger Out */
    ADC3_4_INJTRIGGER_TIM1_CC4   = 1,  /*!< TIM1 Channel 4 */
    ADC3_4_INJTRIGGER_TIM4_CC3   = 2,  /*!< TIM4 Channel 3 */
    ADC3_4_INJTRIGGER_TIM8_CC2   = 3,  /*!< TIM8 Channel 2 */
    ADC3_4_INJTRIGGER_TIM8_CC3   = 4,  /*!< TIM8 Channel 3 */
    ADC3_4_INJTRIGGER_TIM8_CC4   = 5,  /*!< TIM8 Channel 4 */
    ADC3_4_INJTRIGGER_TIM4_CC4   = 6,  /*!< TIM4 Channel 4 */
    ADC3_4_INJTRIGGER_TIM4_TRGO  = 7,  /*!< TIM4 Trigger Out */
    ADC3_4_INJTRIGGER_TIM1_TRGO2 = 8,  /*!< TIM1 Trigger Out 2 */
    ADC3_4_INJTRIGGER_TIM8_TRGO  = 9,  /*!< TIM8 Trigger Out */
    ADC3_4_INJTRIGGER_TIM8_TRGO2 = 10, /*!< TIM8 Trigger Out 2 */
    ADC3_4_INJTRIGGER_TIM1_CC3   = 11, /*!< TIM1 Channel 3 */
    ADC3_4_INJTRIGGER_TIM3_TRGO  = 12, /*!< TIM3 Trigger Out */
    ADC3_4_INJTRIGGER_TIM2_TRGO  = 13, /*!< TIM2 Trigger Out */
    ADC3_4_INJTRIGGER_TIM7_TRGO  = 14, /*!< TIM7 Trigger Out */
    ADC3_4_INJTRIGGER_TIM15_TRGO = 15, /*!< TIM15 Trigger Out */
    ADC3_4_INJTRIGGER_SOFTWARE   = 16  /*!< Implicit trigger by software on start call */
}ADC3_4_InjTriggerSourceType;

/** @brief ADC injected channel setup structure */
typedef struct
{
    FunctionalState    AutoInjection;       /*!< Automatic injected conversion after regular group
                                                 @note External triggers must be disabled */
    FunctionalState    DiscontinuousMode;   /*!< Sets discontinuous mode
                                                 @note Cannot be used with auto injection */
    struct {
        ADC_InjTriggerSourceType InjSource; /*!< Source of the conversion trigger */
        EdgeType                 Edge;      /*!< Trigger edges that initiate conversion */
    }Trigger;
    FunctionalState    ContextQueue;        /*!< Context queue feature */
}ADC_Injected_InitType;

/** @} */

/* Compatibility macros */
#define ADC_INJTRIGGER_TIM1_TRGO  (ADC_INJTRIGGER_TIM1_TRGO)
#define ADC_INJTRIGGER_TIM1_CC4   (ADC_INJTRIGGER_TIM1_CC4)
#define ADC_INJTRIGGER_TIM2_TRGO  (ADC_INJTRIGGER_TIM2_TRGO)
#define ADC_INJTRIGGER_TIM2_CC1   (ADC_INJTRIGGER_TIM2_CC1)
#define ADC_INJTRIGGER_TIM3_CC4   (ADC_INJTRIGGER_TIM3_CC4)
#define ADC_INJTRIGGER_TIM4_TRGO  (ADC_INJTRIGGER_TIM4_TRGO)
#define ADC_INJTRIGGER_EXTI15     (ADC_INJTRIGGER_EXTI15)
#define ADC_INJTRIGGER_TIM8_CC4   (ADC_INJTRIGGER_TIM8_CC4)
#define ADC_INJTRIGGER_TIM1_TRGO2 (ADC_INJTRIGGER_TIM1_TRGO2)
#ifdef HRTIM1
#define ADC_INJTRIGGER_HRTIM_TRG2 (ADC_INJTRIGGER_HRTIM_TRG2)
#define ADC_INJTRIGGER_HRTIM_TRG4 (ADC_INJTRIGGER_HRTIM_TRG4)
#else
#define ADC_INJTRIGGER_TIM8_TRGO  (ADC_INJTRIGGER_TIM8_TRGO)
#define ADC_INJTRIGGER_TIM8_TRGO2 (ADC_INJTRIGGER_TIM8_TRGO2)
#endif
#define ADC_INJTRIGGER_TIM3_CC3   (ADC_INJTRIGGER_TIM3_CC3)
#define ADC_INJTRIGGER_TIM3_TRGO  (ADC_INJTRIGGER_TIM3_TRGO)
#define ADC_INJTRIGGER_TIM3_CC1   (ADC_INJTRIGGER_TIM3_CC1)
#define ADC_INJTRIGGER_TIM6_TRGO  (ADC_INJTRIGGER_TIM6_TRGO)
#define ADC_INJTRIGGER_TIM15_TRGO (ADC_INJTRIGGER_TIM15_TRGO)

/** @addtogroup ADC_Injected_Exported_Functions
 * @{ */
void            XPD_ADC_Injected_Init       (ADC_HandleType * hadc, const ADC_Injected_InitType * Config);
void            XPD_ADC_Injected_ChannelConfig(ADC_HandleType*hadc, const ADC_ChannelInitType * Channels,
                                             uint8_t ChannelCount);

